from typing import Dict, Callable

FREQUENCY_MAP_MACRO = {
    '美国:CPI:同比': 'M', 
    '美国:PPI:最终需求:同比:季调': 'M', 
    '欧元区:HICP(调和CPI):当月同比': 'M', 
    '欧元区20国:PPI:当月同比': 'M', 
    '中国:制造业PMI': 'M', 
    '中国:工业企业:利润总额:当月同比': 'M', 
    '中国:CPI:当月同比': 'M', 
    '中国:PPI:全部工业品:当月同比': 'M', 
    '中国:房地产开发投资完成额:累计同比': 'M', 
    '美国:拖欠率:信用卡消费贷款:所有商业银行:季调': 'Q', 
    '美国:拖欠率:房地产贷款:所有商业银行:季调': 'Q', 
    '中国:零售渗透率:新能源乘用车': 'Y', 
    '中国:社会融资规模:当月值': 'M', 
    '中国:M1:同比': 'M', 
    '中国:M2:同比': 'M'
}
# 注册所有可用的预处理函数
PREPROCESSING_FUNCTIONS_MACRO: Dict[str, Callable] = {

}